bug fixes from QA
